class auto:
    __q=[]
    __abc=[]
    __q0=None
    __f=[]
    __delta=[]
    __condition=None
    
    def __init__(self,Q,ABC,DELTA,Q0,F):
        self.__q=Q
        self.__abc=ABC
        self.__delta=DELTA
        self.__q0=Q0
        self.__f=F
        self.__condition=Q0
    def get_q(self):
        return self.__q
    def get_abc(self):
        return self.__abc
    def get_q0(self):
        return self.__q0
    def get_f(self):
        return self.__f
    def get_delta(self):
        return self.__delta
    def get_condition(self):
        return self.__condition
    
    def work(self,L):
        self.__condition=self.__q0
        for i in L:
            if not(i in self.__abc):
                print("Строка содержит недопустимый символ алфавита: "+i)
                return False
            p=False
            for j in self.__delta:
                if (self.__condition==j[0]) & (i == j[1]):
                    self.__condition=j[2]
                    p=True
                    break
            if not(p):
                print("Для символа "+i+" подходящее правило не найдено")
                return False
        if self.__condition in self.__f:
            return True
        else:
            return False

def read_file (f): 
    ff = open(f ,’r’) 
    result=""
    for i in ff :
        result+=i
    return result

def replace (text , abc , sep): 
    lst=list (text)
    for i in range(len( lst )): 
        if not( lst [ i ] in abc):
            lst [ i]=sep
    result=""
    for i in lst: 
        result=result+str(i) 
    return result




['H','U','P','N','Z','G','F','E'], ['!','+','-','0','1','2','3','4','5','6','7','8','9'], [['H','!','H'],['H','1','U'],['H','2','U'],['H','3','U'],['H','4','U'],['H','5','U'],['H','6','U'],['H','7','U'],['H','8','U'],['H','9','U'],['H','+','P'],['H','-','N'],['H','0','Z'],['P','0','Z'],['P','!','G'],['P','+','G'],['P','-','G'],['P','1','U'],['P','2','U'],['P','3','U'],['P','4','U'],['P','5','U'],['P','6','U'],['P','7','U'],['P','8','U'],['P','9','U'],['U','0','U'],['U','1','U'],['U','2','U'],['U','3','U'],['U','4','U'],['U','5','U'],['U','6','U'],['U','7','U'],['U','8','U'],['U','9','U'],['U','!','F'],['U','+','F'],['U','-','F'],['N','!','G'],['N','+','G'],['N','-','G'],['N','0','Z'],['N','1','U'],['N','2','U'],['N','3','U'],['N','4','U'],['N','5','U'],['N','6','U'],['N','7','U'],['N','8','U'],['N','9','U'],['Z','!','F'],['Z','+','F'],['Z','-','F'],['Z','0','G'],['Z','1','G'],['Z','2','G'],['Z','3','G'],['Z','4','G'],['Z','5','G'],['Z','6','G'],['Z','7','G'],['Z','8','G'],['Z','9','G'],['G','0','G'],['G','1','G'],['G','2','G'],['G','3','G'],['G','4','G'],['G','5','G'],['G','6','G'],['G','7','G'],['G','8','G'],['G','9','G'],['G','!','E'],['G','+','E'],['G','-','E']], 'H', ['F','E']


[
    ['H', '!', 'H'],
    ['H', '1', 'U'],
    ['H', '2', 'U'],
    ['H', '3', 'U'],
    ['H', '4', 'U'],
    ['H', '5', 'U'],
    ['H', '6', 'U'],
    ['H', '7', 'U'],
    ['H', '8', 'U'],
    ['H', '9', 'U'],
    ['H', '+', 'P'],
    ['H', '-', 'N'],
    ['H', '0', 'Z'],
    ['P', '0', 'Z'],
    ['P', '!', 'G'],
    ['P', '+', 'G'],
    ['P', '-', 'G'],
    ['P', '1', 'U'],
    ['P', '2', 'U'],
    ['P', '3', 'U'],
    ['P', '4', 'U'],
    ['P', '5', 'U'],
    ['P', '6', 'U'],
    ['P', '7', 'U'],
    ['P', '8', 'U'],
    ['P', '9', 'U'],
    ['U', '0', 'U'],
    ['U', '1', 'U'],
    ['U', '2', 'U'],
    ['U', '3', 'U'],
    ['U', '4', 'U'],
    ['U', '5', 'U'],
    ['U', '6', 'U'],
    ['U', '7', 'U'],
    ['U', '8', 'U'],
    ['U', '9', 'U'],
    ['U', '!', 'F'],
    ['U', '+', 'F'],
    ['U', '-', 'F'],
    ['N', '!', 'G'],
    ['N', '+', 'G'],
    ['N', '-', 'G'],
    ['N', '0', 'Z'],
    ['N', '1', 'U'],
    ['N', '2', 'U'],
    ['N', '3', 'U'],
    ['N', '4', 'U'],
    ['N', '5', 'U'],
    ['N', '6', 'U'],
    ['N', '7', 'U'],
    ['N', '8', 'U'],
    ['N', '9', 'U'],
    ['Z', '!', 'F'],
    ['Z', '+', 'F'],
    ['Z', '-', 'F'],
    ['Z', '0', 'G'],
    ['Z', '1', 'G'],
    ['Z', '2', 'G'],
    ['Z', '3', 'G'],
    ['Z', '4', 'G'],
    ['Z', '5', 'G'],
    ['Z', '6', 'G'],
    ['Z', '7', 'G'],
    ['Z', '8', 'G'],
    ['Z', '9', 'G'],
    ['G', '0', 'G'],
    ['G', '1', 'G'],
    ['G', '2', 'G'],
    ['G', '3', 'G'],
    ['G', '4', 'G'],
    ['G', '5', 'G'],
    ['G', '6', 'G'],
    ['G', '7', 'G'],
    ['G', '8', 'G'],
    ['G', '9', 'G'],
    ['G', '!', 'E'],
    ['G', '+', 'E'],
    ['G', '-', 'E']
]